jtn0123/ESP32-Temp-Sensor/firmware/arduino/src/net.h
#pragma once

#include <Arduino.h>
#include <WiFi.h>
#include <PubSubClient.h>
#include <Preferences.h>
#include <esp_wifi.h>
#include <time.h>
#include "config.h"
#include "sensors.h"
#include "power.h"

#if USE_WIFI_PROVISIONING
#include <esp_err.h>
#include <esp_event.h>
#include <esp_netif.h>
#include <wifi_provisioning/manager.h>
#if WIFI_PROV_USE_SOFTAP
#include <wifi_provisioning/scheme_softap.h>
#endif
#if WIFI_PROV_USE_BLE
#include <wifi_provisioning/scheme_ble.h>
#endif
#endif

// All configuration should come from generated_config.h

// Forward declarations for functions referenced before their definitions
inline void net_publish_ha_discovery();
inline void net_publish_inside(float tempC, float rhPct);
inline void net_publish_battery(float voltage, int percent);

struct OutsideReadings {
    float temperatureC = NAN;
    float humidityPct = NAN;
    char weather[64];
    float windMps = NAN;
    float highTempC = NAN;
    float lowTempC = NAN;
    bool validTemp = false;
    bool validHum = false;
    bool validWeather = false;
    bool validWind = false;
    bool validHigh = false;
    bool validLow = false;
};

static WiFiClient g_wifi_client;
static PubSubClient g_mqtt(g_wifi_client);
static OutsideReadings g_outside;
static char g_client_id[40];
static Preferences g_net_prefs;
static Preferences g_offline_prefs;

#ifndef WIFI_CONNECT_TIMEOUT_MS
#define WIFI_CONNECT_TIMEOUT_MS 6000
#endif
#ifndef MQTT_CONNECT_TIMEOUT_MS
#define MQTT_CONNECT_TIMEOUT_MS 4000
#endif

inline bool parse_bssid(const char* str, uint8_t out[6]) {
    if (!str) return false;
    int vals[6];
    int n = sscanf(str, "%x:%x:%x:%x:%x:%x", &vals[0], &vals[1], &vals[2], &vals[3], &vals[4], &vals[5]);
    if (n != 6) return false;
    for (int i = 0; i < 6; ++i) out[i] = (uint8_t)vals[i];
    return true;
}

inline bool is_all_zero_bssid(const uint8_t b[6]) {
    for (int i = 0; i < 6; ++i) if (b[i] != 0) return false;
    return true;
}

// Optional tuning knobs (can be overridden via build_flags)
#ifndef WIFI_RSSI_THRESHOLD
#define WIFI_RSSI_THRESHOLD -75
#endif
#ifndef WIFI_AUTHMODE_THRESHOLD
#define WIFI_AUTHMODE_THRESHOLD WIFI_AUTH_WPA2_PSK
#endif

// Number of consecutive failed connects with a pinned BSSID before clearing it
#ifndef WIFI_BSSID_FAIL_CLEAR_N
#define WIFI_BSSID_FAIL_CLEAR_N 3
#endif

// NVS helpers: remember last successful AP (SSID + BSSID)
inline bool nvs_load_last_ap(String& ssid, uint8_t bssid[6]) {
    bool ok = false;
    if (g_net_prefs.begin("net", true)) {
        ssid = g_net_prefs.getString("last_ssid", "");
        size_t n = g_net_prefs.getBytes("last_bssid", bssid, 6);
        g_net_prefs.end();
        if (ssid.length() > 0 && n == 6 && !is_all_zero_bssid(bssid)) ok = true;
    } else {
        ssid = String();
        memset(bssid, 0, 6);
    }
    return ok;
}

inline void nvs_store_last_ap(const char* ssid, const uint8_t bssid[6]) {
    if (!ssid || !bssid) return;
    if (g_net_prefs.begin("net", false)) {
        g_net_prefs.putString("last_ssid", ssid);
        g_net_prefs.putBytes("last_bssid", bssid, 6);
        g_net_prefs.end();
    }
}

// Track consecutive failures when attempting BSSID-pinned joins so we can
// clear the saved BSSID after repeated misses (AP moved/changed).
inline uint32_t nvs_get_bssid_fail_count() {
    uint32_t c = 0;
    if (g_net_prefs.begin("net", true)) {
        c = g_net_prefs.getUInt("bssid_fail", 0);
        g_net_prefs.end();
    }
    return c;
}

inline void nvs_set_bssid_fail_count(uint32_t v) {
    if (g_net_prefs.begin("net", false)) {
        g_net_prefs.putUInt("bssid_fail", v);
        g_net_prefs.end();
    }
}

inline void nvs_clear_last_ap() {
    if (g_net_prefs.begin("net", false)) {
        g_net_prefs.remove("last_bssid");
        g_net_prefs.remove("last_ssid");
        g_net_prefs.end();
    }
}

inline bool ends_with(const char* s, const char* suffix) {
    size_t ls = strlen(s);
    size_t lf = strlen(suffix);
    if (lf > ls) return false;
    return strcmp(s + (ls - lf), suffix) == 0;
}

// -------------------- Time sync (SNTP) --------------------
#ifndef TIME_FRESH_EPOCH_MIN
#define TIME_FRESH_EPOCH_MIN 1609459200UL // 2021-01-01, anything earlier considered stale
#endif
#ifndef TIME_RESYNC_INTERVAL_SEC
#define TIME_RESYNC_INTERVAL_SEC (24UL * 60UL * 60UL) // once per day
#endif

inline bool time_is_stale()
{
    time_t now = time(nullptr);
    uint32_t last_sync = 0;
    if (g_net_prefs.begin("net", true)) {
        last_sync = g_net_prefs.getUInt("last_ntp", 0);
        g_net_prefs.end();
    }
    if ((uint32_t)now < TIME_FRESH_EPOCH_MIN) return true;
    if (last_sync == 0) return true;
    return ((uint32_t)now - last_sync) > TIME_RESYNC_INTERVAL_SEC;
}

inline void ensure_time_synced_if_stale()
{
    if (!WiFi.isConnected()) return;
    if (!time_is_stale()) return;
    // Use IDF/Arduino SNTP helper via configTime; keep timeout short
    configTime(0, 0, "pool.ntp.org", "time.nist.gov", "time.google.com");
    // Poll briefly until time looks sane
    unsigned long start = millis();
    while ((uint32_t)time(nullptr) < TIME_FRESH_EPOCH_MIN && millis() - start < 2000UL) {
        delay(50);
    }
    uint32_t now_epoch = (uint32_t)time(nullptr);
    if (now_epoch >= TIME_FRESH_EPOCH_MIN) {
        if (g_net_prefs.begin("net", false)) {
            g_net_prefs.putUInt("last_ntp", now_epoch);
            g_net_prefs.end();
        }
        Serial.println("Time: SNTP sync ok");
    } else {
        Serial.println("Time: SNTP sync timeout (continuing)");
    }
}

// -------------------- Offline buffer (NVS ring) --------------------
#ifndef OFFLINE_CAPACITY
#define OFFLINE_CAPACITY 96U // number of samples to retain when offline
#endif
#ifndef OFFLINE_DRAIN_MAX_PER_WAKE
#define OFFLINE_DRAIN_MAX_PER_WAKE 64U
#endif
// Additional budgets to prevent long awake time on large backlogs
#ifndef OFFLINE_DRAIN_MAX_MS
#define OFFLINE_DRAIN_MAX_MS 2500UL
#endif
#ifndef OFFLINE_DRAIN_MAX_BYTES
#define OFFLINE_DRAIN_MAX_BYTES 8192UL
#endif

struct OfflineSample {
    uint32_t epoch;
    float tempC;
    float rhPct;
};

