jtn0123/ESP32-Temp-Sensor/firmware/arduino/src/net.h
inline void offline_get_bounds(uint32_t& head, uint32_t& tail)
{
    head = g_offline_prefs.getUInt("head", 0);
    tail = g_offline_prefs.getUInt("tail", 0);
}

inline void offline_set_bounds(uint32_t head, uint32_t tail)
{
    g_offline_prefs.putUInt("head", head);
    g_offline_prefs.putUInt("tail", tail);
}

inline void offline_key_for(uint32_t seq, char out[16])
{
    snprintf(out, 16, "s%u", seq);
}

inline void offline_enqueue_sample(float tempC, float rhPct)
{
    uint32_t ts = (uint32_t)time(nullptr);
    OfflineSample s{ ts, tempC, rhPct };
    if (!g_offline_prefs.begin("obuf", false)) return;
    uint32_t head = 0, tail = 0;
    offline_get_bounds(head, tail);
    // Drop oldest if at capacity
    if (head - tail >= OFFLINE_CAPACITY) {
        char delk[16]; offline_key_for(tail, delk);
        g_offline_prefs.remove(delk);
        tail++;
    }
    char key[16]; offline_key_for(head, key);
    g_offline_prefs.putBytes(key, &s, sizeof(s));
    offline_set_bounds(head + 1, tail);
    g_offline_prefs.end();
    Serial.printf("Offline: queued seq=%u ts=%u (C=%.2f RH=%.0f)\n", (unsigned)head, (unsigned)ts, s.tempC, s.rhPct);
}

inline uint32_t net_publish_inside_history(uint32_t epoch, float tempC, float rhPct)
{
    if (!g_mqtt.connected()) return 0;
    char topic[128];
    snprintf(topic, sizeof(topic), "%s/inside/history", MQTT_PUB_BASE);
    // Build compact JSON with F and RH integer; keep payload small
    char tbuf[16];
    char rhbuf[8];
    dtostrf(tempC * 9.0f/5.0f + 32.0f, 0, 1, tbuf);
    dtostrf(rhPct, 0, 0, rhbuf);
    char payload[96];
    int plen = snprintf(payload, sizeof(payload), "{\"ts\":%u,\"tempF\":%s,\"rh\":%s}", (unsigned)epoch, tbuf, rhbuf);
    g_mqtt.publish(topic, payload, false);
    // Approximate bytes published as topic + payload length
    uint32_t tlen = (uint32_t)strlen(topic);
    uint32_t blen = (uint32_t)(plen > 0 ? plen : (int)strlen(payload));
    return tlen + blen;
}

inline void offline_drain_if_any()
{
    if (!g_mqtt.connected()) return;
    if (!g_offline_prefs.begin("obuf", false)) return;
    uint32_t head = 0, tail = 0;
    offline_get_bounds(head, tail);
    uint32_t to_send = head - tail;
    if (to_send == 0) { g_offline_prefs.end(); return; }
    if (to_send > OFFLINE_DRAIN_MAX_PER_WAKE) to_send = OFFLINE_DRAIN_MAX_PER_WAKE;
    Serial.printf("Offline: draining %u samples (tail=%u head=%u)\n", (unsigned)to_send, (unsigned)tail, (unsigned)head);
    unsigned long drain_start_ms = millis();
    uint32_t bytes_sent = 0;
    uint32_t orig_tail = tail;
    uint32_t processed = 0;
    while (processed < to_send && g_mqtt.connected()) {
        // Time budget check before reading/publishing next sample
        if (OFFLINE_DRAIN_MAX_MS > 0 && (millis() - drain_start_ms) >= OFFLINE_DRAIN_MAX_MS) {
            Serial.printf("Offline: drain stop (time budget) elapsed_ms=%lu sent=%u bytes=%u\n",
                          (unsigned long)(millis() - drain_start_ms), (unsigned)(tail - orig_tail), (unsigned)bytes_sent);
            break;
        }
        uint32_t seq = tail;
        char key[16]; offline_key_for(seq, key);
        OfflineSample s{};
        size_t n = g_offline_prefs.getBytes(key, &s, sizeof(s));
        if (n == sizeof(s)) {
            bytes_sent += net_publish_inside_history(s.epoch, s.tempC, s.rhPct);
            // Immediately delete upon publish; advance tail
            g_offline_prefs.remove(key);
            tail = seq + 1;
            processed++;
            // Give MQTT time to pump
            for (int k = 0; k < 3; ++k) { if (g_mqtt.connected()) g_mqtt.loop(); delay(5); }
            // Post-publish budget checks
            if ((OFFLINE_DRAIN_MAX_BYTES > 0 && bytes_sent >= OFFLINE_DRAIN_MAX_BYTES) ||
                (OFFLINE_DRAIN_MAX_MS > 0 && (millis() - drain_start_ms) >= OFFLINE_DRAIN_MAX_MS)) {
                Serial.printf("Offline: drain stop (%s budget) elapsed_ms=%lu sent=%u bytes=%u\n",
                              (bytes_sent >= OFFLINE_DRAIN_MAX_BYTES ? "byte" : "time"),
                              (unsigned long)(millis() - drain_start_ms), (unsigned)(tail - orig_tail), (unsigned)bytes_sent);
                break;
            }
        } else {
            // Missing or corrupt entry; skip it
            tail = seq + 1;
            processed++;
        }
    }
    offline_set_bounds(head, tail);
    g_offline_prefs.end();
}

inline void mqtt_callback(char* topic, uint8_t* payload, unsigned int length) {
    char val[128];
    unsigned int n = length < (sizeof(val) - 1) ? length : (unsigned int)(sizeof(val) - 1);
    for (unsigned int i = 0; i < n; ++i) val[i] = (char)payload[i];
    val[n] = '\0';
    // Home Assistant birth: when HA announces online, republish discovery and current states
    if (strcmp(topic, "homeassistant/status") == 0) {
        if (n == 6 && memcmp(payload, "online", 6) == 0) {
            net_publish_ha_discovery();
            // Publish current states (inside temp/RH and battery)
            InsideReadings ir = read_inside_sensors();
            if (isfinite(ir.temperatureC) && isfinite(ir.humidityPct)) {
                net_publish_inside(ir.temperatureC, ir.humidityPct);
            }
            BatteryStatus bs = read_battery_status();
            if (isfinite(bs.voltage) && bs.percent >= 0) {
                net_publish_battery(bs.voltage, bs.percent);
            }
        }
        return;
    }
    if (ends_with(topic, "/temp")) {
        g_outside.temperatureC = atof(val);
        g_outside.validTemp = true;
    } else if (ends_with(topic, "/hum") || ends_with(topic, "/rh")) {
        g_outside.humidityPct = atof(val);
        g_outside.validHum = true;
    } else if (ends_with(topic, "/weather")) {
        strncpy(g_outside.weather, val, sizeof(g_outside.weather) - 1);
        g_outside.weather[sizeof(g_outside.weather) - 1] = '\0';
        g_outside.validWeather = g_outside.weather[0] != '\0';
    } else if (ends_with(topic, "/wind") || ends_with(topic, "/wind_mps") || ends_with(topic, "/wind_mph")) {
        float w = atof(val);
        if (ends_with(topic, "/wind_mph")) w = w / 2.237f;
        g_outside.windMps = w;
        g_outside.validWind = isfinite(w);
    } else if (ends_with(topic, "/hi") || ends_with(topic, "/high")) {
        g_outside.highTempC = atof(val);
        g_outside.validHigh = isfinite(g_outside.highTempC);
    } else if (ends_with(topic, "/lo") || ends_with(topic, "/low")) {
        g_outside.lowTempC = atof(val);
        g_outside.validLow = isfinite(g_outside.lowTempC);
    }
}

