jtn0123/ESP32-Temp-Sensor/firmware/arduino/src/net.h
inline void ensure_wifi_connected() {
#if USE_WIFI_PROVISIONING
    ensure_wifi_connected_provisioned_impl();
    return;
#endif
    if (WiFi.isConnected()) return;
    if (strlen(WIFI_SSID) == 0) return;
    Serial.printf("WiFi: connecting to %s...\n", WIFI_SSID);
    WiFi.mode(WIFI_STA);
    WiFi.persistent(false);
    WiFi.setAutoReconnect(true);

    // Constrain scan channels by country when provided (faster, legal)
    #ifdef WIFI_COUNTRY
    #if defined(ESP_ARDUINO_VERSION) && (ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(2,0,0))
    WiFi.setCountry(WIFI_COUNTRY);
    #else
    esp_wifi_set_country_code(WIFI_COUNTRY, true);
    #endif
    #endif
    // Optional static IP configuration
    #ifdef WIFI_STATIC_IP
    {
        IPAddress ip, gw, sn;
        IPAddress d1(0,0,0,0), d2(0,0,0,0);
        bool ok = ip.fromString(WIFI_STATIC_IP) && gw.fromString(WIFI_STATIC_GATEWAY) && sn.fromString(WIFI_STATIC_SUBNET);
        #ifdef WIFI_STATIC_DNS1
        d1.fromString(WIFI_STATIC_DNS1);
        #endif
        #ifdef WIFI_STATIC_DNS2
        d2.fromString(WIFI_STATIC_DNS2);
        #endif
        if (ok) {
            WiFi.config(ip, gw, sn, d1, d2);
        }
    }
    #endif
    // Prefer last known BSSID for fast, reliable joins; don't lock channel
    bool have_bssid = false;
    uint8_t prefer_bssid[6] = {0};
    String last_ssid;
    if (nvs_load_last_ap(last_ssid, prefer_bssid) && last_ssid == WIFI_SSID) {
        have_bssid = true;
    } else {
        // Fall back to compile-time BSSID if provided
        #ifdef WIFI_BSSID
        if (parse_bssid(WIFI_BSSID, prefer_bssid)) {
            have_bssid = true;
        }
        #endif
    }

    // Preconfigure station with connect=false so we can tweak IDF fields before connecting
    if (have_bssid) {
        WiFi.begin(WIFI_SSID, WIFI_PASS, 0 /*channel*/, prefer_bssid, false /*connect*/);
        Serial.printf("WiFi: preferring BSSID %02x:%02x:%02x:%02x:%02x:%02x\n",
                      prefer_bssid[0], prefer_bssid[1], prefer_bssid[2],
                      prefer_bssid[3], prefer_bssid[4], prefer_bssid[5]);
    } else {
        WiFi.begin(WIFI_SSID, WIFI_PASS, 0 /*channel*/, nullptr, false /*connect*/);
    }

    // Apply FAST scan + thresholds, and ensure channel is unlocked
    wifi_config_t cfg;
    memset(&cfg, 0, sizeof(cfg));
    esp_wifi_get_config(WIFI_IF_STA, &cfg);
    cfg.sta.scan_method = WIFI_FAST_SCAN;
    cfg.sta.threshold.rssi = WIFI_RSSI_THRESHOLD;
    cfg.sta.threshold.authmode = WIFI_AUTHMODE_THRESHOLD;
    cfg.sta.channel = 0; // do not hard-lock channel
    if (have_bssid) {
        memcpy(cfg.sta.bssid, prefer_bssid, 6);
        cfg.sta.bssid_set = 1;
    } else {
        memset(cfg.sta.bssid, 0, 6);
        cfg.sta.bssid_set = 0;
    }
    esp_wifi_set_config(WIFI_IF_STA, &cfg);

    // Start Wi-Fi and attempt to connect
    esp_wifi_start();
    esp_wifi_connect();

    unsigned long start = millis();
    // Give BSSID-pinned attempt a shorter window before falling back
    unsigned long bssid_try_ms = have_bssid ? (WIFI_CONNECT_TIMEOUT_MS > 4000 ? 3000UL : WIFI_CONNECT_TIMEOUT_MS / 2) : 0UL;
    bool fallback_done = false;
    while (!WiFi.isConnected() && millis() - start < WIFI_CONNECT_TIMEOUT_MS) {
        if (have_bssid && !fallback_done && (millis() - start) >= bssid_try_ms) {
            // Fallback: clear BSSID to allow roaming / broad match
            Serial.println("WiFi: BSSID join slow; falling back to SSID-only");
            esp_wifi_disconnect();
            wifi_config_t cfg2;
            memset(&cfg2, 0, sizeof(cfg2));
            esp_wifi_get_config(WIFI_IF_STA, &cfg2);
            memset(cfg2.sta.bssid, 0, 6);
            cfg2.sta.bssid_set = 0;
            cfg2.sta.scan_method = WIFI_FAST_SCAN;
            cfg2.sta.threshold.rssi = WIFI_RSSI_THRESHOLD;
            cfg2.sta.threshold.authmode = WIFI_AUTHMODE_THRESHOLD;
            cfg2.sta.channel = 0;
            esp_wifi_set_config(WIFI_IF_STA, &cfg2);
            esp_wifi_connect();
            fallback_done = true;
        }
        delay(100);
    }
    if (WiFi.isConnected()) {
        Serial.printf("WiFi: connected, IP %s RSSI %d dBm\n", WiFi.localIP().toString().c_str(), WiFi.RSSI());
        // Reset failure counter on success
        nvs_set_bssid_fail_count(0);
        // Cache last SSID + BSSID for next wake
        uint8_t now_bssid[6] = {0};
        const uint8_t* bp = WiFi.BSSID();
        if (bp) memcpy(now_bssid, bp, 6);
        if (!is_all_zero_bssid(now_bssid)) {
            nvs_store_last_ap(WIFI_SSID, now_bssid);
        }
    } else {
        Serial.printf("WiFi: connect timeout (status=%d)\n", (int)WiFi.status());
        // Increment consecutive failure count and clear saved BSSID after N misses
        if (have_bssid) {
            uint32_t c = nvs_get_bssid_fail_count();
            c++;
            nvs_set_bssid_fail_count(c);
            if (c >= WIFI_BSSID_FAIL_CLEAR_N) {
                Serial.println("WiFi: clearing saved BSSID after repeated failures");
                nvs_clear_last_ap();
                nvs_set_bssid_fail_count(0);
            }
        }
    }
}

inline void ensure_mqtt_connected() {
    if (g_mqtt.connected()) return;
    if (strlen(MQTT_HOST) == 0) return;
    g_mqtt.setServer(MQTT_HOST, MQTT_PORT);
    // Broker stability: larger keepalive and buffers; shorter socket timeout
    g_mqtt.setKeepAlive(60);
    g_mqtt.setSocketTimeout(5);
    #ifdef MQTT_MAX_PACKET_SIZE
    g_mqtt.setBufferSize(MQTT_MAX_PACKET_SIZE);
    #else
    g_mqtt.setBufferSize(1024);
    #endif
    g_mqtt.setCallback(mqtt_callback);
    Serial.printf("MQTT: connecting to %s:%u...\n", MQTT_HOST, (unsigned)MQTT_PORT);
    uint64_t mac = ESP.getEfuseMac();
    // Use lower 24 bits
    snprintf(g_client_id, sizeof(g_client_id), "esp32-room-%06x", (unsigned int)(mac & 0xFFFFFF));
    unsigned long start = millis();
    const char* user = nullptr;
    const char* pass = nullptr;
    #ifdef MQTT_USER
    if (strlen(MQTT_USER) > 0) user = MQTT_USER;
    #endif
    #ifdef MQTT_PASS
    if (strlen(MQTT_PASS) > 0) pass = MQTT_PASS;
    #endif
    // Set LWT to availability topic so HA can mark device offline if we drop unexpectedly
    char availTopic[128];
    snprintf(availTopic, sizeof(availTopic), "%s/availability", MQTT_PUB_BASE);
    while (!g_mqtt.connect(g_client_id, user, pass, availTopic, 0, true, "offline") && millis() - start < MQTT_CONNECT_TIMEOUT_MS) {
        delay(200);
    }
    if (g_mqtt.connected()) {
        Serial.println("MQTT: connected");
        // Publish availability online on successful connect
        g_mqtt.publish(availTopic, "online", true);
        char topic[128];
        const char* base = MQTT_SUB_BASE;
        auto sub = [&](const char* suffix){
            snprintf(topic, sizeof(topic), "%s%s", base, suffix);
            g_mqtt.subscribe(topic);
            Serial.printf("MQTT: subscribed %s\n", topic);
        };
        sub("/temp");
        sub("/hum");
        sub("/rh");
        sub("/weather");
        sub("/wind");
        sub("/wind_mps");
        sub("/wind_mph");
        sub("/high");
        sub("/hi");
        sub("/low");
        sub("/lo");
        // Subscribe to Home Assistant birth topic for rediscovery on HA restarts
        g_mqtt.subscribe("homeassistant/status");
        Serial.printf("MQTT: subscribed %s\n", "homeassistant/status");
        // On successful MQTT connection, try to drain any offline backlog
        offline_drain_if_any();
    } else {
        Serial.println("MQTT: connect timeout/fail");
    }
}

inline void net_begin() {
    ensure_wifi_connected();
    // Refresh time occasionally; quick and only when stale
    ensure_time_synced_if_stale();
    ensure_mqtt_connected();
}

inline void net_loop() {
    static bool last_wifi = false;
    static bool last_mqtt = false;
    if (!WiFi.isConnected()) ensure_wifi_connected();
    if (WiFi.isConnected() && !g_mqtt.connected()) ensure_mqtt_connected();
    bool now_wifi = WiFi.isConnected();
    bool now_mqtt = g_mqtt.connected();
    if (now_wifi != last_wifi) {
        Serial.printf("WiFi: %s\n", now_wifi ? "up" : "down");
        last_wifi = now_wifi;
    }
    if (now_mqtt != last_mqtt) {
        Serial.printf("MQTT: %s\n", now_mqtt ? "up" : "down");
        last_mqtt = now_mqtt;
    }
    if (now_mqtt) g_mqtt.loop();
}

inline String net_ip() {
    if (!WiFi.isConnected()) return String("0.0.0.0");
    return WiFi.localIP().toString();
}

inline void net_ip_cstr(char* out, size_t out_size) {
    if (!out || out_size == 0) return;
    if (!WiFi.isConnected()) {
        snprintf(out, out_size, "%s", "0.0.0.0");
        return;
    }
    IPAddress ip = WiFi.localIP();
    snprintf(out, out_size, "%u.%u.%u.%u", (unsigned)ip[0], (unsigned)ip[1], (unsigned)ip[2], (unsigned)ip[3]);
}

inline void mqtt_pump(uint32_t duration_ms) {
    unsigned long start = millis();
    while (millis() - start < duration_ms) {
        if (g_mqtt.connected()) g_mqtt.loop();
        delay(10);
    }
}

inline OutsideReadings net_get_outside() { return g_outside; }

