jtn0123/ESP32-Temp-Sensor/firmware/arduino/src/net.h
inline void net_publish_inside(float tempC, float rhPct) {
    if (!g_mqtt.connected()) {
        // Buffer a compact record for later publish with timestamp
        offline_enqueue_sample(tempC, rhPct);
        return;
    }
    char topic[128];
    char payload[32];
    const char* base = MQTT_PUB_BASE;
    snprintf(topic, sizeof(topic), "%s/inside/temp", base);
    // Publish Fahrenheit for HA (discovery advertises °F)
    float tempF = tempC * 9.0f/5.0f + 32.0f;
    dtostrf(tempF, 0, 1, payload);
    g_mqtt.publish(topic, payload, true);
    snprintf(topic, sizeof(topic), "%s/inside/hum", base);
    dtostrf(rhPct, 0, 0, payload);
    g_mqtt.publish(topic, payload, true);
}

inline void net_publish_battery(float voltage, int percent) {
    if (!g_mqtt.connected()) return;
    char topic[128];
    char payload[32];
    const char* base = MQTT_PUB_BASE;
    // voltage
    snprintf(topic, sizeof(topic), "%s/battery/voltage", base);
    dtostrf(voltage, 0, 2, payload);
    g_mqtt.publish(topic, payload, true);
    // percent
    snprintf(topic, sizeof(topic), "%s/battery/percent", base);
    snprintf(payload, sizeof(payload), "%d", percent);
    g_mqtt.publish(topic, payload, true);
}

inline void net_publish_status(const char* payload, bool retain = true) {
    if (!g_mqtt.connected() || !payload) return;
    char topic[128];
    snprintf(topic, sizeof(topic), "%s/status", MQTT_PUB_BASE);
    g_mqtt.publish(topic, payload, retain);
}

// Publish a JSON debug payload with wake metrics to sensors/<node>/debug
inline void net_publish_debug_json(const char* payload, bool retain = false) {
    if (!g_mqtt.connected() || !payload) return;
    char topic[128];
    snprintf(topic, sizeof(topic), "%s/debug", MQTT_PUB_BASE);
    g_mqtt.publish(topic, payload, retain);
}

// Publish a small probe message to measure publish latency without affecting retained state
inline void net_publish_debug_probe(const char* payload, bool retain = false) {
    if (!g_mqtt.connected() || !payload) return;
    char topic[128];
    snprintf(topic, sizeof(topic), "%s/debug_probe", MQTT_PUB_BASE);
    g_mqtt.publish(topic, payload, retain);
}

// Publish Home Assistant MQTT Discovery configs for inside temperature and humidity
inline void net_publish_ha_discovery() {
    if (!g_mqtt.connected()) return;
    // Topics and availability
    char availTopic[128];
    snprintf(availTopic, sizeof(availTopic), "%s/availability", MQTT_PUB_BASE);

    // Helper to publish one discovery config
    auto pub_disc = [&](const char* key, const char* name, const char* unit, const char* dev_class, const char* state_suffix){
        char discTopic[192];
        snprintf(discTopic, sizeof(discTopic), "homeassistant/sensor/%s_%s/config", g_client_id, key);
        char stateTopic[192];
        snprintf(stateTopic, sizeof(stateTopic), "%s/%s", MQTT_PUB_BASE, state_suffix);
        char payload[640];
        // Full HA discovery keys for maximum compatibility; retained
        snprintf(payload, sizeof(payload),
            "{\"name\":\"%s\",\"unique_id\":\"%s_%s\",\"state_topic\":\"%s\",\"availability_topic\":\"%s\",\"unit_of_measurement\":\"%s\",\"device_class\":\"%s\",\"state_class\":\"measurement\",\"device\":{\"identifiers\":[\"%s\"],\"name\":\"ESP32 Room Node: %s\",\"manufacturer\":\"DIY\",\"model\":\"Feather ESP32-S2\"}}",
            name, g_client_id, key, stateTopic, availTopic, unit, dev_class, g_client_id, ROOM_NAME);
        g_mqtt.publish(discTopic, payload, true);
        Serial.print("HA discovery -> ");
        Serial.println(discTopic);
    };

    pub_disc("inside_temp",   "Inside Temperature", "°F", "temperature", "inside/temp");
    pub_disc("inside_hum",    "Inside Humidity",    "%",  "humidity",    "inside/hum");
    pub_disc("battery_volts", "Battery Voltage",    "V",  "voltage",     "battery/voltage");
    pub_disc("battery_pct",   "Battery",            "%",  "battery",     "battery/percent");
}

inline bool net_wifi_is_connected() {
    return WiFi.isConnected();
}

inline bool net_mqtt_is_connected() {
    return g_mqtt.connected();
}

inline void net_prepare_for_sleep() {
    // Publish availability offline and disconnect cleanly before deep sleep
    if (g_mqtt.connected()) {
        char availTopic[128];
        snprintf(availTopic, sizeof(availTopic), "%s/availability", MQTT_PUB_BASE);
        g_mqtt.publish(availTopic, "offline", true);
        mqtt_pump(100);
        g_mqtt.disconnect();
    }
    if (WiFi.isConnected()) {
        WiFi.disconnect(true);
    }
}


